юв_гит_/src/Documents/Производство/Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Производство</name>
  <basedOn>Document.ЗаказВМастерскую</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ПроизводствоИзделий</registerRecords>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>Потребность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>ТипНоменклатуры</name>
      <type>
        <types>EnumRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзСпецификации</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.ТехнологическиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОпераций</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Нормочасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

юв_гит_/src/Documents/Производство/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Производство.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Производство.Дата,
	|	Производство.ЗаказКлиента,
	|	Производство.Изделие,
	|	Производство.Номер,
	|	Производство.Потребность,
	|	Производство.Спецификация,
	|	Производство.Материалы.(
	|		НомерСтроки,
	|		ТипНоменклатуры,
	|		Материал,
	|		ИзСпецификации,
	|		ЕдИзм,
	|		Количество
	|	),
	|	Производство.Операции.(
	|		НомерСтроки,
	|		Спецификация,
	|		РабочееМесто,
	|		Операция,
	|		НормаВремени,
	|		КоличествоОпераций,
	|		Нормочасы
	|	)
	|ИЗ
	|	Документ.Производство КАК Производство
	|ГДЕ
	|	Производство.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьМатериалыШапка = Макет.ПолучитьОбласть("МатериалыШапка");
	ОбластьМатериалы = Макет.ПолучитьОбласть("Материалы");
	ОбластьОперацииШапка = Макет.ПолучитьОбласть("ОперацииШапка");
	ОбластьОперации = Макет.ПолучитьОбласть("Операции");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьМатериалыШапка);
		ВыборкаМатериалы = Выборка.Материалы.Выбрать();
		Пока ВыборкаМатериалы.Следующий() Цикл
			ОбластьМатериалы.Параметры.Заполнить(ВыборкаМатериалы);
			ТабДок.Вывести(ОбластьМатериалы, ВыборкаМатериалы.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьОперацииШапка);
		ВыборкаОперации = Выборка.Операции.Выбрать();
		Пока ВыборкаОперации.Следующий() Цикл
			ОбластьОперации.Параметры.Заполнить(ВыборкаОперации);
			ТабДок.Вывести(ОбластьОперации, ВыборкаОперации.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
